#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


module.kubernetes.module.infinity-gauntlet.module.services.module.longhorn.helm_release.longhorn: Refreshing state... [id=longhorn]
module.kubernetes.module.infinity-gauntlet.module.namespaces.kubernetes_namespace.namespace["zerotier"]: Refreshing state... [id=zerotier]
module.kubernetes.module.infinity-gauntlet.module.namespaces.kubernetes_namespace.namespace["terraform"]: Refreshing state... [id=terraform]
module.kubernetes.module.infinity-gauntlet.module.services.module.prometheus.helm_release.prometheus: Refreshing state... [id=prometheus]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.kubernetes.module.infinity-gauntlet.module.services.module.default-backend.helm_release.default-backend: Refreshing state... [id=default-backend]
module.synology.module.minio.minio_s3_bucket.bucket["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.kubernetes_namespace.namespace: Refreshing state... [id=pi-hole-exporter]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["mind"]: Refreshing state... [id=config/e4:5f:01:27:c8:af.yaml]
module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.node_k3os_config["soul"]: Refreshing state... [id=config/e4:5f:01:05:41:72.yaml]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_namespace.namespace: Refreshing state... [id=actions-runner-system]
module.synology.module.minio.minio_iam_user.user["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus-89d357e66b8535cf2bc464679a9edc8b]
module.kubernetes.module.infinity-gauntlet.module.services.module.cert-manager.helm_release.cert-manager: Refreshing state... [id=cert-manager]
module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus-76c65925919ddc6d7883f7a8c9ecfddb]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80]
module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_secret.controller_authentication_configuration: Refreshing state... [id=actions-runner-system/controller-manager]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211004073649778800000004]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus-20211004074253101900000001]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211004073649730700000001]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211004073649753300000002]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20211004074253191200000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20211004074253263000000004]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_prometheus"]: Refreshing state... [id=state-infinity-gauntlet-prometheus-20211004073649762600000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20211004074253131500000002]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.kubernetes_secret.configuration: Refreshing state... [id=pi-hole-exporter/pi-hole]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.helm_release.github-actions-runner-controller: Refreshing state... [id=actions-runner-controller]
module.kubernetes.module.infinity-gauntlet.module.services.module.pi-hole-exporter.helm_release.pi-hole-exporter: Refreshing state... [id=pi-hole-exporter]
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["zt"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["tf"]: Refreshing state...
module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["tf"]: Refreshing state...

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_longhorn"] has been changed
  ~ resource "minio_iam_policy" "policy" {
        id     = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80"
        name   = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn",
                            "arn:aws:s3:::state-infinity-gauntlet-longhorn/*",
                          + "arn:aws:s3:::state-infinity-gauntlet-longhorn",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"] has been changed
  ~ resource "minio_iam_policy" "policy" {
        id     = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7"
        name   = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::tftp-netboot-infinity-gauntlet/*",
                            "arn:aws:s3:::tftp-netboot-infinity-gauntlet",
                          + "arn:aws:s3:::tftp-netboot-infinity-gauntlet/*",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_longhorn"] has been changed
  ~ resource "minio_iam_policy" "policy_global" {
        id     = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b"
        name   = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:GetBucketLocation",
                            "s3:ListAllMyBuckets",
                          + "s3:GetBucketLocation",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_prometheus"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "state-infinity-gauntlet-prometheus-20211004073649762600000003"
      ~ policy_name = "state-infinity-gauntlet-prometheus-76c65925919ddc6d7883f7a8c9ecfddb" -> "state-infinity-gauntlet-prometheus-89d357e66b8535cf2bc464679a9edc8b"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
        id          = "state-infinity-gauntlet-etcd-20211004073649730700000001"
      ~ policy_name = "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" -> "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
        id          = "state-infinity-gauntlet-longhorn-20211004073649753300000002"
      ~ policy_name = "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b" -> "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
        id          = "tftp-netboot-infinity-gauntlet-20211004073649778800000004"
      ~ policy_name = "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" -> "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7"
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_prometheus"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-prometheus-20211004073649762600000003" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-prometheus-89d357e66b8535cf2bc464679a9edc8b" -> "state-infinity-gauntlet-prometheus-76c65925919ddc6d7883f7a8c9ecfddb" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "state-infinity-gauntlet-etcd-20211004073649730700000001" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-etcd-b7e1c7219c68f66fca69407033834ccc" -> "state-infinity-gauntlet-etcd-89d357e66b8535cf2bc464679a9edc8b" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "state-infinity-gauntlet-longhorn-20211004073649753300000002" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-longhorn-0e2d8692356ab8c3d8507ae269f29b80" -> "state-infinity-gauntlet-longhorn-89d357e66b8535cf2bc464679a9edc8b" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "tftp-netboot-infinity-gauntlet-20211004073649778800000004" -> (known after apply)
      ~ policy_name = "tftp-netboot-infinity-gauntlet-7eb59e69950e7707143160eee63051c7" -> "tftp-netboot-infinity-gauntlet-89d357e66b8535cf2bc464679a9edc8b" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment["tf"] will be updated in-place
  ~ resource "kubernetes_manifest" "runner_deployment" {
      ~ manifest = {
          ~ metadata   = {
              ~ namespace = "default" -> "terraform"
                # (2 unchanged elements hidden)
            }
          ~ spec       = {
              ~ template = {
                  ~ metadata = {
                      ~ labels = {
                          + github.com/login      = "wyrihaximus"
                          ~ github.com/repository = "wyrihaximus/terraform" -> "terraform"
                            # (1 unchanged element hidden)
                        }
                    }
                    # (1 unchanged element hidden)
                }
            }
            # (2 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ namespace = "default" -> "terraform"
                # (2 unchanged elements hidden)
            }
          ~ spec       = {
              ~ template = {
                  ~ metadata = {
                      ~ labels      = {
                          + "github.com/login"      = "wyrihaximus"
                          ~ "github.com/repository" = "wyrihaximus/terraform" -> "terraform"
                            # (1 unchanged element hidden)
                        }
                        # (4 unchanged elements hidden)
                    }
                    # (1 unchanged element hidden)
                }
                # (2 unchanged elements hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["tf"] will be updated in-place
  ~ resource "kubernetes_manifest" "runner_deployment_autoscaler" {
      ~ manifest = {
          ~ metadata   = {
              ~ namespace = "default" -> "terraform"
                # (2 unchanged elements hidden)
            }
          ~ spec       = {
              + scaleDownDelaySecondsAfterScaleOut = 3600
                # (4 unchanged elements hidden)
            }
            # (2 unchanged elements hidden)
        }
      ~ object   = {
          ~ metadata   = {
              ~ namespace = "default" -> "terraform"
                # (2 unchanged elements hidden)
            }
          ~ spec       = {
              ~ scaleDownDelaySecondsAfterScaleOut = null -> 3600
                # (7 unchanged elements hidden)
            }
            # (2 unchanged elements hidden)
        }
    }

  # module.kubernetes.module.infinity-gauntlet.module.services.module.github-actions-runners.kubernetes_manifest.runner_deployment_autoscaler["zt"] will be created
  + resource "kubernetes_manifest" "runner_deployment_autoscaler" {
      + manifest = {
          + apiVersion = "actions.summerwind.dev/v1alpha1"
          + kind       = "HorizontalRunnerAutoscaler"
          + metadata   = {
              + labels    = {
                  + repository = "k8s-zerotier"
                  + type       = "user"
                  + user       = "wyrihaximus"
                }
              + name      = "user-wyrihaximus-k8s-zerotier"
              + namespace = "zerotier"
            }
          + spec       = {
              + maxReplicas                        = 1024
              + metrics                            = [
                  + {
                      + repositoryNames = [
                          + "wyrihaximus/k8s-zerotier",
                        ]
                      + type            = "TotalNumberOfQueuedAndInProgressWorkflowRuns"
                    },
                ]
              + minReplicas                        = 0
              + scaleDownDelaySecondsAfterScaleOut = 3600
              + scaleTargetRef                     = {
                  + name = "user-wyrihaximus-k8s-zerotier"
                }
            }
        }
      + object   = {
          + apiVersion = "actions.summerwind.dev/v1alpha1"
          + kind       = "HorizontalRunnerAutoscaler"
          + metadata   = {
              + labels    = (known after apply)
              + name      = "user-wyrihaximus-k8s-zerotier"
              + namespace = "zerotier"
            }
          + spec       = {
              + capacityReservations               = (known after apply)
              + maxReplicas                        = 1024
              + metrics                            = [
                  + {
                      + repositoryNames     = [
                          + "wyrihaximus/k8s-zerotier",
                        ]
                      + scaleDownAdjustment = (known after apply)
                      + scaleDownFactor     = (known after apply)
                      + scaleDownThreshold  = (known after apply)
                      + scaleUpAdjustment   = (known after apply)
                      + scaleUpFactor       = (known after apply)
                      + scaleUpThreshold    = (known after apply)
                      + type                = "TotalNumberOfQueuedAndInProgressWorkflowRuns"
                    },
                ]
              + minReplicas                        = 0
              + scaleDownDelaySecondsAfterScaleOut = 3600
              + scaleTargetRef                     = {
                  + kind = (known after apply)
                  + name = "user-wyrihaximus-k8s-zerotier"
                }
              + scaleUpTriggers                    = (known after apply)
              + scheduledOverrides                 = (known after apply)
            }
        }
    }

Plan: 5 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>